{
  "_name_or_path": "deepseek-ai/DeepSeek-R1-Distill-Qwen-7B",
  "architectures": [
    "Qwen2ForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "eos_token_id": 151643,
  "hidden_act": "silu",
  "hidden_size": 3584,
  "initializer_range": 0.02,
  "intermediate_size": 18944,
  "max_position_embeddings": 131072,
  "max_window_layers": 28,
  "model_type": "qwen2",
  "num_attention_heads": 28,
  "num_hidden_layers": 28,
  "num_key_value_heads": 4,
  "quantization_config": {
    "amp": true,
    "autoround_version": "0.4.4",
    "batch_size": 4,
    "bits": 4,
    "damp_percent": 0.01,
    "data_type": "int",
    "desc_act": false,
    "enable_minmax_tuning": true,
    "enable_norm_bias_tuning": false,
    "enable_quanted_input": true,
    "gradient_accumulate_steps": 2,
    "group_size": 128,
    "iters": 256,
    "low_gpu_mem_usage": false,
    "lr": 0.00390625,
    "minmax_lr": 0.00390625,
    "nsamples": 128,
    "quant_method": "gptq",
    "scale_dtype": "torch.float16",
    "seqlen": 2048,
    "sym": true,
    "to_quant_block_names": null,
    "true_sequential": false
  },
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.48.0",
  "use_cache": true,
  "use_mrope": false,
  "use_sliding_window": false,
  "vocab_size": 152064
}
